[
  {
    "name": "The Hundred Years' War on Palestine",
    "genre": "non-fiction",
    "author": "Rashid Khalidi",
    "description": "A landmark history of one hundred years of war waged against the Palestinians from the foremost US historian of the Middle East, told through pivotal events and family history",
    "price": 18.99,
    "image": "images/hundredyearwar.jpeg",
    "language": "English",
    "rating": 4.7
  },
  {
    "name": "milk and honey",
    "genre": "poetry",
    "author": "rupi kaur",
    "description": "The book is divided into four chapters, and each chapter serves a different purpose. Deals with a different pain. Heals a different heartache. milk and honey\n takes readers through a journey of the most bitter moments in life and finds sweetness in them because there is sweetness everywhere if you are just willing to look.",
    "price": 14.99,
    "image": "images/milkandhoney.jpeg",
    "language": "English",
    "rating": 4.01
  },
  {
    "name": "Wonder",
    "genre": "fiction",
    "author": "R J. Palacio",
    "description": "Millions of people have fallen in love with Auggie Pullman, an ordinary boy with an extraordinary face\n—who shows us that kindness brings us together no matter how far apart we are.",
    "price": 17.99,
    "image": "images/wonder.jpeg",
    "language": "English",
    "rating": 4.39
  },
  {
    "name": "The Alchemist",
    "genre": "fiction",
    "author": "Paulo Coelho",
    "description": "Combining magic, mysticism, wisdom and wonder into an inspiring tale of self-discovery, The Alchemist\n has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations.",
    "price": 15.99,
    "image": "images/thealchemist.jpeg",
    "language": "English",
    "rating": 3.9
  },
  {
    "name": "It Ends With Us",
    "genre": "fiction",
    "author": "Colleen Hoover",
    "description": "From the #1 New York Times bestselling author of It Starts with Us and All Your Perfects, a “brave and heartbreaking novel that digs its claws into you and doesn’t let go, long after you’ve finished it” (Anna Todd, New York Times bestselling author) about a workaholic with a too-good-to-be-true romance can’t stop thinking about her first love.",
    "price": 16.99,
    "image": "images/itendswithus.jpeg",
    "language": "English",
    "rating": 4.36
  },
  {
    "name": "مهنتي كملك // My Profession as King",
    "genre": "non-fiction",
    "author": "King Hussein Bin Talal",
    "description": "An autobipgraphy of King Hussein Bin Talal of Jordan.",
    "price": 12.99,
    "image": "images/mehnati.jpeg",
    "language": "Arabic",
    "rating": 4.02
  },
  {
    "name": "رحلة جبلية رحلة صعبة // A Mountainous Journey: A Poet’s Autobiography",
    "genre": "non-fiction",
    "author": "Fadwa Tuqan",
    "description": "An autobiogrpahy of Fadwa Tuqan, a palestinian poet.",
    "price": 11.99,
    "image": "images/re7leh.jpeg",
    "language": "Arabic",
    "rating": 3.88
  },
  {
    "name": "أعراس آمنة // Amenah’s Weddings",
    "genre": "fiction",
    "author": "Ibrahim Nassrallah",
    "description": "Twin sisters Randa and Lamis live in the besieged Gaza Strip. Inseparable to the point that even their mother cannot tell them apart, they grow up surrounded by the random carnage that characterizes life under occupation. Randa, who wants to be a journalist, writes to record the devastation around her, taking pictures of martyred children. Meanwhile, their beloved neighbor Amna quietly converses with all those she has lost, as she plans the wedding of Lamis and her son Saleh. With their menfolk almost entirely absent, it is the women who take center stage in this poignant novel of resilience, determination, and living against the odds.",
    "price": 19.99,
    "image": "images/a3ras.jpeg",
    "language": "Arabic",
    "rating": 4.12
  },
  {
    "name": "L'étranger",
    "genre": "fiction",
    "author": "Albert Camus",
    "description": "Quand al sonnerie a encore retenti, que la porte du box s’est ouverte, c’est le silence de la salle qui est monté vers moi, le silence, et cette singuliere sensation que j’ai eue lorsque j’ai constaté que le jeune journaliste avait détourné les yeux. Je n’ai pas regardé du côté de Marie. Je n’en ai pas eu le temps parce que le président m’a dit dans une forme bizarre que j’aurais la tête tranchée sur une place publique au nom du peuple français…",
    "price": 13.36,
    "image": "images/etranger.jpeg",
    "language": "French",
    "rating": 4.01
  },
  {
    "name": "Le ventre de l’Atlantique",
    "genre": "non-fiction",
    "author": "Fatou Diome",
    "description": "Salie vit en France. Son frère, Madické, rêve de l’y rejoindre et compte sur elle. Mais comment lui expliquer la face cachée de l’immigration, lui qui voit la France comme une terre promise où réussissentles footballeurs sénégalais, où vont se réfugier ceux qui, comme Sankèle, fuient un destin tragique ? Les relations entre Madické et Salie nous dévoilent l’inconfortable situation des « venus de France », écrasés par les attentes démesurées de ceux qui sont restés au pays et confrontés à la difficulté d’être l’autre partout. Distillant leurre et espoir, Le Ventre de l’Atlantique charrie entre l’Europe et l’Afrique des destins contrastés. Car, même si la souffrance de ceux qui restent est indicible, il s’agit de partir, voguer, libre comme une alguede l’Atlantique.Ce premier roman, sans concession, est servi par une écriture pleine de souffleet d’humour.Read less",
    "price": 21.95,
    "image": "images/ventre.jpeg",
    "language": "French",
    "rating": 3.78
  },
  {
    "name": "اللص والكلاب // The Thief and the Dogs",
    "genre": "fiction",
    "author": "Najeeb Mahfouz",
    "description": "After four years in prison, the skilled young thief Said Mahran emerges bent on revenge. He finds a world that has changed in more ways than one. Egypt has undergone a revolution and, on a more personal level, his beloved wife and his trusted henchman, who conspired to betray him to the police, are now married to each other and are keeping his six-year-old daughter from him. But in the most bitter betrayal, his mentor, Rauf Ilwan, once a firebrand revolutionary who convinced Said that stealing from the rich in a unjust society is an act of justice, is now himself a rich man, a respected newspaper editor who wants nothing to do with the disgraced Said. As Said's wild attempts to achieve his idea of justice badly misfire, he becomes a hunted man so driven by hatred that he can only recognize too late his last chance at redemption.",
    "price": 16,
    "image": "images/le9walkelab.jpeg",
    "language": "Arabic",
    "rating": 3.66
  },
  {
    "name": "Les Fleurs du Mal",
    "genre": "poetry",
    "author": "Charles Baudelaire",
    "description": "Charles Baudelaire’s 1857 masterwork was scandalous in its day for its portrayals of sex, same-sex love, death, the corrupting and oppressive power of the modern city and lost innocence, Les Fleurs Du Mal (The Flowers of Evil) remains powerful and relevant for our time.In “Spleen et idéal,” Baudelaire dramatizes the erotic cycle of ecstacy and anguish―of sexual and romantic love. “Tableaux Parisiens” condemns the crushing effects of urban planning on a city’s soul and praises the city’s anti-heroes including the deranged and derelict. “Le Vin” centers on the search for oblivion in drink and drugs. The many kinds of love that lie outside traditional morality is the focus of “Fleurs du Mal” while rebellion is at the heart of “Révolte.”",
    "price": 19.95,
    "image": "images/fleurs.jpeg",
    "language": "French",
    "rating": 4.22
  }
]